// Задача 2. Напишите программу, которая найдёт точку
//пересечения двух прямых, заданных уравнениями y = k1 *
//x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются
//пользователем.

Console.WriteLine("Hello, World!");


int b1 = 2;
int k1 = 5;
int b2 = 4;
int k2 = 9;
//int y = k1 * x + b1
Console.WriteLine("Hello, World!");